{
    "slug":  "terms-of-service",
    "id":  3,
    "excerpt":  "\u003cp\u003eTerms of Service Effective date: 2026-01-13 These Terms of Service (“Terms”) govern your\u0026hellip;\u003c/p\u003e\n",
    "parent":  0,
    "template":  "",
    "content":  "\t\t\u003cdiv data-elementor-type=\"wp-page\" data-elementor-id=\"3\" class=\"elementor elementor-3\"\u003e\n\t\t\t\t\u003cdiv class=\"elementor-element elementor-element-5c7679b e-flex e-con-boxed sc_layouts_column_icons_position_left e-con e-parent\" data-id=\"5c7679b\" data-element_type=\"container\" data-e-type=\"container\"\u003e\n\t\t\t\t\t\u003cdiv class=\"e-con-inner\"\u003e\n\t\t\t\t\u003cdiv class=\"elementor-element elementor-element-5bf44db sc_fly_static elementor-widget elementor-widget-text-editor\" data-id=\"5bf44db\" data-element_type=\"widget\" data-e-type=\"widget\" data-widget_type=\"text-editor.default\"\u003e\n\t\t\t\t\t\t\t\t\t\u003ch1\u003eTerms of Service\u003c/h1\u003e\n\u003cp\u003e\u003cstrong\u003eEffective date:\u003c/strong\u003e 2026-01-13\u003c/p\u003e\n\n\u003cp\u003e\n  These Terms of Service (“\u003cstrong\u003eTerms\u003c/strong\u003e”) govern your access to and use of the WhiteKnight Academy website and platform\n  (the “\u003cstrong\u003ePlatform\u003c/strong\u003e”) and any related services, including online chess lessons, subscriptions, learning tools,\n  and AI-assisted features (collectively, the “\u003cstrong\u003eServices\u003c/strong\u003e”).\n\u003c/p\u003e\n\n\u003cp\u003e\n  \u003cstrong\u003eService Provider / Operator (EU/Poland):\u003c/strong\u003e \u003cstrong\u003eTheBroda sp. z o.o.\u003c/strong\u003e\u003cbr /\u003e\n  KRS 0000677402, NIP 5242831345, REGON 367267919\u003cbr /\u003e\n  ul. Wierna 12, 03-890 Warszawa, Poland\u003cbr /\u003e\n  \u003cstrong\u003eContact:\u003c/strong\u003e \u003ca href=\"mailto:contact@whiteknight.academy\"\u003econtact@whiteknight.academy\u003c/a\u003e\n\u003c/p\u003e\n\n\u003cp\u003e\n  By creating an account, purchasing a subscription, booking lessons, or otherwise using the Services, you agree to these Terms.\n  If you do not agree, do not use the Services.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e1. Definitions\u003c/h2\u003e\n\u003cul\u003e\n  \u003cli\u003e\u003cstrong\u003eConsumer\u003c/strong\u003e means a natural person acting outside their trade, business, craft, or profession (EU/Poland).\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eBusiness Customer\u003c/strong\u003e means an individual or entity using the Services for professional/business purposes.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eAccount Owner\u003c/strong\u003e means the person who registers an account and controls payments and settings.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eChild\u003c/strong\u003e means a person under 18 participating under a Parent/Guardian account (see Section 3).\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eContent\u003c/strong\u003e includes lesson materials, exercises, analysis, text, audio, video, and other materials made available through the Services.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eThird-Party Services\u003c/strong\u003e are services not operated by us (e.g., payment processors, video meeting tools, analytics/ad tools, external chess platforms/APIs).\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e2. The Services\u003c/h2\u003e\n\u003cp\u003e\n  WhiteKnight Academy provides online chess learning, which may include:\n\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eLive lessons (primarily via \u003cstrong\u003eGoogle Meet\u003c/strong\u003e; \u003cstrong\u003eZoom\u003c/strong\u003e may be used as backup).\u003c/li\u003e\n  \u003cli\u003eGroup and/or individual sessions (depending on your plan and availability).\u003c/li\u003e\n  \u003cli\u003eInteractive chess tools (boards, exercises, puzzles, analysis features).\u003c/li\u003e\n  \u003cli\u003eProgress tracking and recommendations (including AI-assisted features).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\n  We may update, modify, add, or remove features and Content from time to time.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e3. Eligibility, Child Participation, and Parental Responsibility\u003c/h2\u003e\n\u003cp\u003e\n  \u003cstrong\u003eAccounts are intended for adults.\u003c/strong\u003e To create an account and purchase Services, you must be at least \u003cstrong\u003e18 years old\u003c/strong\u003e\n  (or the age of majority in your jurisdiction).\n\u003c/p\u003e\n\n\u003cp\u003e\n  \u003cstrong\u003eChildren participate under a Parent/Guardian account.\u003c/strong\u003e A Parent/Guardian (the Account Owner) may allow a Child to attend lessons under the Parent/Guardian’s account.\n  The Parent/Guardian is responsible for:\n\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003ethe Child’s participation and supervision as appropriate,\u003c/li\u003e\n  \u003cli\u003eensuring the Child complies with these Terms,\u003c/li\u003e\n  \u003cli\u003eproviding any legally required consents (including, where applicable in the USA, verifiable parental consent for children under 13).\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\n  If we believe we cannot lawfully provide Services in a specific situation (e.g., required consents are missing), we may restrict, suspend, or terminate access.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e4. Account Security\u003c/h2\u003e\n\u003cul\u003e\n  \u003cli\u003eYou must provide accurate information and keep it updated.\u003c/li\u003e\n  \u003cli\u003eYou are responsible for all activity on your account, including activity by a Child using your account.\u003c/li\u003e\n  \u003cli\u003eYou must keep your login credentials confidential and notify us of unauthorized access.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e5. Trials, Plans, Subscriptions, Renewals, and Payments\u003c/h2\u003e\n\n\u003ch3\u003e5.1 Trial / First Lesson\u003c/h3\u003e\n\u003cp\u003e\n  We may offer a trial or first lesson (“\u003cstrong\u003eTrial\u003c/strong\u003e”). The Trial is currently offered for \u003cstrong\u003eEUR 10\u003c/strong\u003e for one lesson,\n  but the Trial price and availability may change (and may be offered for free) at any time.\n  The applicable Trial terms (price, duration, what is included, and any limitations) will always be shown at checkout or on the relevant product page.\n\u003c/p\u003e\n\u003cp\u003e\n  \u003cstrong\u003eRefunds for Trial:\u003c/strong\u003e If you cancel before the Trial lesson begins, we will refund the Trial fee.\n  If the Trial lesson has already been delivered, the Trial fee is non-refundable, unless mandatory law requires otherwise.\n\u003c/p\u003e\n\n\u003ch3\u003e5.2 Prices and Taxes\u003c/h3\u003e\n\u003cp\u003e\n  Prices and plan details are displayed on the Platform at the time of purchase.\n  \u003cstrong\u003eDisplayed prices are subject to change and the price shown at checkout applies.\u003c/strong\u003e\n  Taxes may apply depending on your location and applicable law.\n  Currency conversion and payment processing are handled by the payment providers.\n\u003c/p\u003e\n\n\u003ch3\u003e5.3 Payment Processors (Stripe and PayPal)\u003c/h3\u003e\n\u003cp\u003e\n  We use third-party payment processors, including \u003cstrong\u003eStripe\u003c/strong\u003e and \u003cstrong\u003ePayPal\u003c/strong\u003e. Payment details are handled by these providers under their own terms and privacy policies.\n  We do not store full payment card details on our servers.\n\u003c/p\u003e\n\n\u003ch3\u003e5.4 Subscription Types and Renewal\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003e\u003cstrong\u003eMonthly subscriptions:\u003c/strong\u003e may renew automatically each billing cycle unless canceled.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eAnnual subscriptions:\u003c/strong\u003e \u003cstrong\u003edo not renew automatically\u003c/strong\u003e unless explicitly stated at checkout (and you opt in).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\n  Depending on the product and your settings, renewals may be processed automatically or may require manual renewal.\n  Exact renewal behavior will be displayed in your account and/or at checkout.\n\u003c/p\u003e\n\n\u003ch3\u003e5.5 Cancellation (Effective end of next billing cycle)\u003c/h3\u003e\n\u003cp\u003e\n  You may cancel a subscription at any time in your account settings (or by contacting us). Unless mandatory law requires otherwise:\n\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eYour cancellation takes effect at the \u003cstrong\u003eend of your current billing cycle\u003c/strong\u003e.\u003c/li\u003e\n  \u003cli\u003eYou will not be charged for subsequent billing cycles after cancellation is effective.\u003c/li\u003e\n  \u003cli\u003eWe do not provide prorated refunds for unused time within an already paid billing cycle.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003e5.6 Minimum Commitment (First paid billing cycle)\u003c/h3\u003e\n\u003cp\u003e\n  Unless stated otherwise at checkout, after a Trial (if any), your \u003cstrong\u003efirst paid billing cycle\u003c/strong\u003e is a minimum commitment period.\n  This means that after you start the first paid cycle, fees for that cycle are generally \u003cstrong\u003enon-refundable\u003c/strong\u003e,\n  except where mandatory consumer law requires a refund or partial refund.\n\u003c/p\u003e\n\n\u003ch3\u003e5.7 EU/Poland Consumer Right of Withdrawal (Distance Contracts)\u003c/h3\u003e\n\u003cp\u003e\n  If you are an EU/EEA Consumer, you generally have a statutory right to withdraw from a distance contract within \u003cstrong\u003e14 days\u003c/strong\u003e.\n  For services, the withdrawal period is typically 14 days from the day the contract is concluded.\n\u003c/p\u003e\n\u003cp\u003e\n  \u003cstrong\u003eImportant:\u003c/strong\u003e If you request that we begin providing services (or digital content/services) during the withdrawal period,\n  you may lose your right of withdrawal once performance begins, if you provided the legally required express consent and acknowledgment.\n  Where required by law, we will present the relevant checkboxes/notices at checkout.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e6. Lessons: Scheduling, Attendance, Rescheduling (Flexible Policy)\u003c/h2\u003e\n\n\u003ch3\u003e6.1 Scheduling and Time Zones\u003c/h3\u003e\n\u003cp\u003e\n  Lesson schedules and availability are shown on the Platform. Group placement may depend on skill level, age group, language, and availability.\n\u003c/p\u003e\n\n\u003ch3\u003e6.2 Missed Lessons (No-Show)\u003c/h3\u003e\n\u003cp\u003e\n  If you (or your Child) miss a scheduled lesson without timely notice, the lesson is considered delivered and is \u003cstrong\u003enot refundable\u003c/strong\u003e.\n\u003c/p\u003e\n\n\u003ch3\u003e6.3 Rescheduling (Flexible approach)\u003c/h3\u003e\n\u003cp\u003e\n  We aim to be fair while keeping group schedules stable. Unless stated otherwise for a specific plan/product:\n\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003e\u003cstrong\u003eStandard rule:\u003c/strong\u003e requests made at least \u003cstrong\u003e24 hours\u003c/strong\u003e before the lesson start time are eligible for rescheduling or a make-up option, subject to availability.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eShort-notice option:\u003c/strong\u003e once per billing cycle, you may request a reschedule with shorter notice (down to \u003cstrong\u003e6 hours\u003c/strong\u003e before start),\n      subject to availability. Additional short-notice requests are not guaranteed.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eUnder 6 hours:\u003c/strong\u003e rescheduling is generally not available (except at our sole discretion for emergencies).\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eGroup lessons:\u003c/strong\u003e make-up options may be limited due to fixed group schedules.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003e6.4 Our Changes / Tutor Unavailability\u003c/h3\u003e\n\u003cp\u003e\n  If we must cancel or reschedule due to tutor unavailability or technical issues on our side, we will offer (at our discretion) a rescheduled session or account credit.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e7. Language of Instruction\u003c/h2\u003e\n\u003cp\u003e\n  We currently offer instruction in \u003cstrong\u003eEnglish (EN)\u003c/strong\u003e, \u003cstrong\u003eUkrainian (UA)\u003c/strong\u003e, and \u003cstrong\u003ePolish (PL)\u003c/strong\u003e.\n  Availability depends on tutor schedules.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e8. Recordings, Photos, and Promotional Content\u003c/h2\u003e\n\u003cp\u003e\n  \u003cstrong\u003eLessons are not recorded by default.\u003c/strong\u003e Recording, photography, or promotional content involving a Child will occur only with\n  explicit Parent/Guardian consent (e.g., checkbox/consent form/email confirmation) and as permitted by law.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e9. Acceptable Use\u003c/h2\u003e\n\u003cp\u003e\n  You agree not to misuse the Services. Prohibited activities include:\n\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eHarassment, hate speech, bullying, or abusive conduct toward tutors, staff, or other users.\u003c/li\u003e\n  \u003cli\u003eUploading malware or attempting unauthorized access to the Platform or its systems.\u003c/li\u003e\n  \u003cli\u003eUsing the Services to violate laws, third-party rights, or platform rules.\u003c/li\u003e\n  \u003cli\u003eInfringing intellectual property (see Section 12).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\n  We may moderate content and interactions to protect users, including Children, and to maintain a safe learning environment.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e10. Third-Party Services, Open-Source Tools, and Chess Technology\u003c/h2\u003e\n\u003cp\u003e\n  The Services may rely on Third-Party Services. Those services are not operated by us and may have their own terms and policies.\n\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003e\u003cstrong\u003eChess.com and Lichess APIs:\u003c/strong\u003e We may connect to \u003ca href=\"https://www.chess.com/\" target=\"_blank\" rel=\"noopener\"\u003eChess.com\u003c/a\u003e and\n      \u003ca href=\"https://lichess.org/\" target=\"_blank\" rel=\"noopener\"\u003eLichess\u003c/a\u003e via their APIs to support certain features. We are not affiliated with these platforms.\n      Availability may depend on their API limits, outages, or policy changes.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eChessboard UI:\u003c/strong\u003e We use the open-source project\n      \u003ca href=\"https://github.com/Clariity/react-chessboard\" target=\"_blank\" rel=\"noopener\"\u003ereact-chessboard\u003c/a\u003e.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eChess engine:\u003c/strong\u003e We use \u003cstrong\u003eStockfish\u003c/strong\u003e for analysis features. Engine evaluations are educational and may be imperfect.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eVideo tools:\u003c/strong\u003e Lessons may be delivered via Google Meet and/or Zoom.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003ePayments:\u003c/strong\u003e Stripe and PayPal process payments.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\n  Your use of Third-Party Services is subject to their terms. We are not responsible for third-party outages, policy changes, or actions.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e11. Privacy, Cookies, and Marketing\u003c/h2\u003e\n\u003cp\u003e\n  Our \u003ca href=\"/privacy-policy/\"\u003ePrivacy Policy\u003c/a\u003e explains how we process personal data, cookies, consent, and international transfers.\n\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003e\u003cstrong\u003eTutors/Coaches:\u003c/strong\u003e we may share necessary student information with tutors under contract, only to provide lessons for the relevant students.\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eMarketing emails:\u003c/strong\u003e we may send newsletters/updates if you have provided consent (you can opt out anytime).\u003c/li\u003e\n  \u003cli\u003e\u003cstrong\u003eAdvertising \u0026amp; remarketing:\u003c/strong\u003e we may use cookies/consent-based tools to create custom audiences and run retargeting/remarketing\n      where permitted by law and based on your consent choices.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\n  For California users (and where applicable), see \u003ca href=\"/do-not-sell-or-share\"\u003eDo Not Sell or Share My Personal Information\u003c/a\u003e.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e12. Intellectual Property\u003c/h2\u003e\n\u003cp\u003e\n  We (or our licensors) own the Services and Content, including branding, lesson materials, and platform design, except where stated otherwise.\n  You receive a limited, non-exclusive, non-transferable, revocable license to use the Services for personal, non-commercial learning purposes.\n\u003c/p\u003e\n\u003cp\u003e\n  You may not copy, redistribute, publicly display, sell, sublicense, reverse engineer, or create derivative works from our Content,\n  except where expressly permitted by law or by us in writing.\n\u003c/p\u003e\n\u003cp\u003e\n  Open-source components (including chessboard UI and engine) are governed by their respective licenses; nothing in these Terms limits your rights under those licenses.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e13. User Content\u003c/h2\u003e\n\u003cp\u003e\n  You may provide content such as messages, feedback, game annotations, and other submissions (“User Content”).\n  You grant us a worldwide, non-exclusive license to use User Content solely to operate, provide, support, secure, and improve the Services.\n\u003c/p\u003e\n\u003cp\u003e\n  You represent that you have the rights necessary to provide User Content and that it does not violate laws or third-party rights.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e14. AI-Assisted Features\u003c/h2\u003e\n\u003cp\u003e\n  We may use AI-assisted tools to support the Services, including search, recommendations, group matching, quality monitoring, and progress reporting.\n  \u003cstrong\u003eAI assists; humans make final decisions.\u003c/strong\u003e\n\u003c/p\u003e\n\u003cp\u003e\n  AI outputs may be inaccurate or incomplete and are provided for educational/support purposes only.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e15. Sponsored Seats, Scholarships, and Programs via Foundations\u003c/h2\u003e\n\u003cp\u003e\n  We may offer free or discounted access to lessons through sponsored programs, grants, partnerships, or foundations (“\u003cstrong\u003eSponsored Programs\u003c/strong\u003e”).\n  Sponsored Programs may be limited by availability and may require eligibility review and moderation.\n\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eSponsored access may be provided as free seats, coupons, or credits and generally has \u003cstrong\u003eno cash value\u003c/strong\u003e and is non-transferable.\u003c/li\u003e\n  \u003cli\u003eWe may require a brief eligibility explanation and contact details. We aim to minimize sensitive documentation unless required by the sponsor or by law.\u003c/li\u003e\n  \u003cli\u003eIf a Sponsored participant stops attending without notice, we may reassign the seat to another applicant.\u003c/li\u003e\n  \u003cli\u003eSponsored Programs may be administered together with a foundation or partner; additional terms may apply and will be provided where relevant.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e16. Partnerships (Federations, Schools, and Other Organizations)\u003c/h2\u003e\n\u003cp\u003e\n  We may cooperate with chess federations (e.g., Poland, Ukraine, Canada), international organizations (including FIDE), schools, clubs, and other partners.\n  Such cooperation may include discounted access, coupons, joint events, educational programs, or recognition of achievements.\n\u003c/p\u003e\n\u003cp\u003e\n  Unless explicitly stated, partnerships do not mean that any federation or organization endorses or controls the Platform.\n  Use of names/logos will occur only when authorized.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e17. Service Availability and Maintenance\u003c/h2\u003e\n\u003cp\u003e\n  We strive to keep the Services available, but we do not guarantee uninterrupted access. Maintenance and outages may occur.\n  You are responsible for your internet connection and compatible devices.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e18. Suspension and Termination\u003c/h2\u003e\n\u003cp\u003e\n  We may suspend or terminate access if you breach these Terms, misuse the Services, fail to pay, or if required for safety/legal reasons.\n  We may also remove content or restrict features as needed to protect users and the Platform.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e19. Complaints and Consumer Dispute Resolution\u003c/h2\u003e\n\u003cp\u003e\n  If you have a complaint, contact us at \u003ca href=\"mailto:contact@whiteknight.academy\"\u003econtact@whiteknight.academy\u003c/a\u003e.\n  We will try to resolve issues promptly.\n\u003c/p\u003e\n\u003cp\u003e\n  \u003cstrong\u003eEU note:\u003c/strong\u003e The European Commission’s Online Dispute Resolution (ODR) platform has been discontinued as of 20 July 2025.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e20. Disclaimers\u003c/h2\u003e\n\u003cp\u003e\n  The Services are provided “as is” and “as available”, to the maximum extent permitted by law.\n  We do not guarantee specific chess outcomes, ratings, tournament results, or educational progress.\n  Nothing in these Terms limits mandatory consumer rights under applicable law.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e21. Limitation of Liability\u003c/h2\u003e\n\u003cp\u003e\n  To the maximum extent permitted by law, we are not liable for indirect, incidental, special, consequential, or punitive damages,\n  or for lost profits, revenues, data, or goodwill.\n\u003c/p\u003e\n\u003cp\u003e\n  Where liability cannot be excluded (including for Consumers under EU/Poland mandatory law), our liability is limited to the extent permitted by law and,\n  in any event, to the amount paid for the Services in the \u003cstrong\u003e3 months\u003c/strong\u003e preceding the event giving rise to the claim (unless mandatory law requires otherwise).\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e22. Business Customers (B2B) and Invoices\u003c/h2\u003e\n\u003cp\u003e\n  If you use the Services as a Business Customer, certain consumer protections (including withdrawal rights) may not apply,\n  except where mandatory law extends consumer-like protections to specific business users (e.g., sole traders in certain circumstances).\n\u003c/p\u003e\n\u003cp\u003e\n  Business Customers may request invoices and may be subject to additional verification, billing, or contractual terms for organizational programs, schools, federations, or foundations.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e23. International Use\u003c/h2\u003e\n\u003cp\u003e\n  The Services are operated from Poland but may be accessed internationally (including Canada and the USA during initial pilots).\n  You are responsible for complying with local laws applicable to your use. Mandatory consumer protections in your jurisdiction may still apply.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e24. Governing Law and Jurisdiction\u003c/h2\u003e\n\u003cp\u003e\n  These Terms are governed by the laws of Poland.\n  If you are a Consumer in the EEA/UK, you also benefit from mandatory protections under the laws of your country of residence and may bring claims in your local courts where required by consumer law.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e25. Changes to the Terms\u003c/h2\u003e\n\u003cp\u003e\n  We may update these Terms from time to time. If changes are material, we will provide reasonable notice (e.g., posting on the Platform or emailing the Account Owner).\n  Continued use after the effective date means you accept the updated Terms.\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003e26. Contact\u003c/h2\u003e\n\u003cp\u003e\n  TheBroda sp. z o.o., ul. Wierna 12, 03-890 Warszawa, Poland\u003cbr /\u003e\n  Email: \u003ca href=\"mailto:contact@whiteknight.academy\"\u003econtact@whiteknight.academy\u003c/a\u003e\n\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003ch2\u003eOptional Annex: EU Consumer Withdrawal (Template Notice)\u003c/h2\u003e\n\u003cp\u003e\n  If you wish to withdraw from a distance contract (where applicable), you may send an unequivocal statement to:\n  \u003ca href=\"mailto:contact@whiteknight.academy\"\u003econtact@whiteknight.academy\u003c/a\u003e.\n\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSample text:\u003c/em\u003e\u003cbr /\u003e\n  “I hereby give notice that I withdraw from my contract for the provision of WhiteKnight Academy services. Account email: [your email]. Date: [date]. Name: [name].”\n\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t",
    "link":  "https://whiteknight.academy/terms-of-service/",
    "date":  "2026-01-13T09:34:31",
    "modified":  "2026-01-13T17:30:08",
    "status":  "publish",
    "title":  "Terms of Service (WhiteKnight Academy)"
}
